{
  "main": {
    "header": "Добро пожаловать в Lingify!",
    "header2": "Ваш инструмент для создания уникальных искусственных языков!",
    "header3": "Войди или зарегистрируйся чтобы создать свой уникальный язык",
    "buttonRegister": "Зарегистрироваться",
    "buttonSighIn": "Войти",
    "about": "Создавайте собственные языки легко и быстро с помощью передовых нейросетевых технологий. Наше приложение позволяет не только генерировать новые языки, но и редактировать их, переводить тексты и управлять своим языковым портфолио.",
    "neural": "Нейросети",
    "neuralAbout": "Нейросети берут на себя большую часть монотонной работы, позволяя уделить время более важным вещам",
    "research": "Исследования",
    "researchAbout": "Лингвистические исследования в области языкознания, конструирование новых и реконструирование утерянных языков",
    "fast": "Cкорость работы",
    "fastAbout": " Веб-приложение позволяет оптимизировать время разработки конлангов за счет мастера создания языков и редактора",
    "nsu": "ЦИИ НГУ",
    "nsuAbout": "Разработка ведется в рамках заказа от ЦИИ НГУ для филологического и журналистского факультетов.",
    "handbook1": "Узнайте о возможностях веб-приложения Lingify в ",
    "handbook2": "руководстве"
  },
  "profile": {
    "Tabs1" : "Профиль",
    "Tabs2" : "Мои языки",
    "Tabs3" : "Перевод",
    "Tabs4" : "Генерация текста",
    "Tabs5" : "Настройки",


    "user1" : "Профиль пользователя",
    "user2" : "email: ",
    "user3" : "Аккаунт активирован",
    "user4" : "Аккаунт не активирован",
    "user5" : "Имя: ",
    "user6" : "Фамилия: ",
    "user7" : "Нет данных ",


    "LangList" : "Сортировать... ",


    "Translate1" : "Выберите язык... ",
    "Translate2" : "Пишите текст здесь... ",
    "Translate3" : "Перевод... ",
    
    
    "Generate1" : "Здесь вы можете с помощью Искусственного Интеллекта сгенерировать нужный текст на созданном Вами языке.",
    "Generate2" : "Сгенерированный текст появится здесь... ",
    "Generate3" : "Сгенерировать текст",
    
    
    
    
    
    "preferences1" : "Настройки аккаунта",
    "preferences2" : "Выйти из аккаунта:",
    "preferences3" : "Удалить аккаунт:",
    "preferences4" : "Если у вас есть вопросы можете написать нам на почту:",
    "changeUserInterfaceLang": "Сменить язык интерфейса:"
  },
  "about": {
    "Title": "О проекте Lingify",
    "text1": "Добро пожаловать в Lingify — уникальное веб-приложение, созданное для тех, кто хочет погрузиться в мир языков и творчества! Мы разработали Lingify с использованием современных технологий, таких как React, TypeScript, Node.js и PostgreSQL, чтобы предоставить вам мощный инструмент для создания собственных языков и правил. Наша цель — сделать процесс изучения и создания языков увлекательным и доступным для всех.",
    "text2": "С помощью Lingify вы можете не только создавать свои уникальные языки, но и использовать нейронные сети на базе Gigachat для автоматического перевода с русского и английского на ваши придуманные языки. Это значит, что вы можете легко экспериментировать с новыми лексическими структурами и грамматическими правилами, а также получать мгновенные переводы, которые помогут вам лучше понять, как работает ваш язык.",
    "text3": "Lingify предлагает вам возможность редактировать и дополнять уже созданные языки, а также создавать новые языки вручную. Вы можете настраивать фонетику, грамматику и словарный запас, чтобы ваш язык стал поистине уникальным. Наша команда постоянно работает над улучшением приложения, добавляя новые функции и возможности, чтобы сделать ваш опыт еще более увлекательным.",
    "text4": "С Lingify вы сможете не только развивать свои языковые навыки, но и воплощать в жизнь самые смелые идеи.",
      "text5": "Наша почта: "
  },

  "handbook": {
    "title1": "Руководство",
    "section1": "Создание языка",
    "handbook1": "Перейдите в раздел, где можно создать новый язык. Введите название языка — например, Мой язык. Потом настройте его: укажите, сколько слов в словаре, как будут строиться предложения, какие части речи есть (существительные, глаголы и так далее). Выберите стиль — например, официальный или дружелюбный. Определите правила письма и произношения. Можно указать, какие буквы используются. После того как всё заполните и проверите, нажмите кнопку Создать. Новый язык появится в вашем списке",

    "section2": "Редактирование языка",
    "handbook2": "Выберите язык из списка своих языков. Нажмите кнопку Редактировать. В открывшемся окне вы можете изменить название языка, правила его построения, стиль или добавить новые слова. Внесите нужные изменения и сохраните их. Всё обновится сразу. Если передумали — есть кнопка Отмена, чтобы выйти без сохранения.",

    "section3": "Создание языка с помощью нейронных сетей",
    "handbook3": "Перейдите в раздел для автоматического создания языка с помощью искусственного интеллекта. Заполните поля: название языка, сколько слов должно быть в словаре, какой стиль и грамматика вам нужны. Можно выбрать параметры для обучения нейросети или оставить стандартные настройки. Нажмите кнопку Генерировать и подождите немного — нейросеть создаст язык по вашим параметрам. После этого вы можете проверить результат и сохранить его или изменить вручную.",

    "section4": "Управление языками",
    "handbook4": "Перейдите в раздел, где можно создать новый язык. Введите название языка — например, Мой язык. Потом настройте его: укажите, сколько слов в словаре, как будут строиться предложения, какие части речи есть (существительные, глаголы и так далее). Выберите стиль — например, официальный или дружелюбный. Определите правила письма и произношения. Можно указать, какие буквы используются. После того как всё заполните и проверите, нажмите кнопку Создать. Новый язык появится в вашем списке",

    "section5": "Управление аккаунтом",
    "handbook5": "Чтобы начать работу на сайте — войдите в свой аккаунт, указав логин и пароль. Когда закончите работу — выйдите через кнопку Выйти. Если хотите удалить свой аккаунт — перейдите в настройки профиля и выберите опцию удаления аккаунта; подтвердите удаление по электронной почте или коду подтверждения. После этого все ваши данные исчезнут навсегда.",

    "section6": "Настройки сайта",
    "handbook6": "Перейдите в раздел настроек сайта. Там можно выбрать язык интерфейса: русский или английский — чтобы сайт был понятнее вам. Также можно выбрать тему оформления: светлую или тёмную — чтобы было комфортно смотреть на экран. Есть дополнительные настройки: например, включить уведомления или изменить формат даты и времени. После выбора не забудьте сохранить изменения. Если нужно что-то уточнить или сделать ещё проще — скажите!"
  },
  "redact": {
    "changeUserInterfaceLang": "Change UI language"
  },
  "creationPage": {
    "changeUserInterfaceLang": "Change UI language"
  }
}
